==================
description instead of slot name
==================

[myslot] : one of aaa .

---
(policyspace (ERROR (description) (UNEXPECTED 'a')))

==================
missing value
==================

myslot : one of .

---
(policyspace (slot (identifier (identifier_value)) (atomic_values (identifier (MISSING identifier_value)))))

==================
missing dot
==================

myslot : one of those

---
(policyspace (slot (identifier (identifier_value)) (atomic_values (identifier (identifier_value))) (MISSING ".")))


====================================
missing comma
====================================

myslot[descriptions1] : some of something somethingElse.

---
(policyspace (slot (identifier (identifier_value) (description)) (aggregate_values (identifier (identifier_value))) (ERROR (UNEXPECTED 't'))))


