==================
description instead of slot name
==================

[myslot] : one of aaa .

---
(source_file (ERROR (description) (UNEXPECTED 'a')))

==================
missing value
==================

myslot : one of .

---
(source_file (slot (identifier_simple) (atomic_values (MISSING identifier_simple))))

==================
missing dot
==================

myslot : one of those

---
(source_file (slot (identifier_simple) (atomic_values (identifier_simple)) (MISSING ".")))


====================================
missing comma
====================================

myslot[descriptions1] : some of something somethingElse.

---
(source_file 
    (slot 
        (identifier_with_desc 
            (identifier_simple) 
            (description)) 
        (aggregate_values 
            (identifier_simple)) 
        (ERROR (UNEXPECTED 't'))))


