==================
basic compound slot
==================

myslot : consists of something .

---
(policyspace (slot (identifier (identifier_value)) (compound_values (identifier_value))))

====================================
multiple compound slot with descriptions
====================================

myslot[descriptions1] : consists of something, somethingElse , evenMoreSomething .

---
(policyspace (slot (identifier (identifier_value) (description)) (compound_values (identifier_value) (identifier_value) (identifier_value))))


====================================
basic compound slot with descriptions - ERROR
====================================

myslot[descriptions1] :  consists of something [description2].

---
(policyspace (slot (identifier (identifier_value) (description)) (compound_values (identifier_value)) (ERROR (description))))



====================================
compound slot with descriptions - ERROR
====================================

myslot[descriptions1] : consists of something [description2], somethingElse [else thingy!], evenMoreSomething [much else?].

---
(policyspace (slot (identifier (identifier_value) (description)) (compound_values (identifier_value) (ERROR (description)) (identifier_value) (ERROR (description)) (identifier_value)) (ERROR (description))))


===========================================
compound slot with descriptions and comment
===========================================

myslot[descriptions1] : consists of something , <* a wild [comment] appears!*> somethingElse , evenMoreSomething.

---
(policyspace (slot (identifier (identifier_value) (description)) (compound_values (identifier_value) (comment) (identifier_value) (identifier_value))))