==================
basic aggregate slot
==================

myslot : some of something .

---
(policyspace (slot (identifier (identifier_value)) (aggregate_values (slot_value (identifier_value)))))



====================================
basic aggregate slot with descriptions
====================================

myslot[descriptions1] : some of something [description2].

---
(policyspace (slot (identifier (identifier_value) (description)) (aggregate_values (slot_value (identifier_value)) (description))))


====================================
aggregate slot with descriptions
====================================

myslot[descriptions1] : some of something [description2], somethingElse [else thingy!], evenMoreSomething [much else?].

---
(policyspace (slot (identifier (identifier_value) (description)) (aggregate_values (slot_value (identifier_value)) (description) (slot_value (identifier_value)) (description) (slot_value (identifier_value)) (description))))

===========================================
aggregate slot with descriptions and comment
===========================================

myslot[descriptions1] : some of something [descrip
            tion2], <* a wild [comment] appears!*> somethingElse [else thingy!], evenMoreSomething [much else?].

---
(policyspace (slot (identifier (identifier_value) (description)) (aggregate_values (slot_value (identifier_value)) (description) (comment) (slot_value (identifier_value)) (description) (slot_value (identifier_value)) (description))))