==================
basic atomic slot
==================

myslot : one of something .

---
(policyspace (slot (identifier (identifier_value)) (atomic_values (slot_value (identifier_value)))))


====================================
basic atomic slot with descriptions
====================================

myslot[descriptions1] : one of something [description2].

---
(policyspace (slot (identifier (identifier_value) (description)) (atomic_values (slot_value (identifier_value)) (description))))


====================================
atomic slot with descriptions
====================================

myslot[descriptions1] : one of something [description2], somethingElse [else thingy!], evenMoreSomething [much else?].

---
(policyspace (slot (identifier (identifier_value) (description)) (atomic_values (slot_value (identifier_value)) (description) (slot_value (identifier_value)) (description) (slot_value (identifier_value)) (description))))


===========================================
atomic slot with descriptions and comment
===========================================

myslot[descriptions1] : one of something [descrip
            tion2], <* a wild [comment] appears!*> somethingElse [else thingy!], evenMoreSomething [much else?].

---
(policyspace (slot (identifier (identifier_value) (description)) (atomic_values (slot_value (identifier_value)) (description) (comment) (slot_value (identifier_value)) (description) (slot_value (identifier_value)) (description))))