==================
basic aggregate slot
==================

myslot : some of something .

---
(policyspace
    (slot
        (identifier (identifier_value))
        (aggregate_values 
            (identifier (identifier_value)))))




====================================
basic aggregate slot with descriptions
====================================

myslot[descriptions1] : some of something [description2].

---
(policyspace (slot (identifier (identifier_value) (description)) (aggregate_values (identifier (identifier_value) (description)))))


====================================
aggregate slot with descriptions
====================================

myslot[descriptions1] : some of something [description2], somethingElse [else thingy!], evenMoreSomething [much else?].

---
(policyspace (slot (identifier (identifier_value) (description)) (aggregate_values (identifier (identifier_value) (description)) (identifier (identifier_value) (description)) (identifier (identifier_value) (description)))))


===========================================
aggregate slot with descriptions and comment
===========================================

myslot[descriptions1] : some of something [descrip
            tion2], <* a wild [comment] appears!*> somethingElse [else thingy!], evenMoreSomething [much else?].

---
(policyspace (slot (identifier (identifier_value) (description)) (aggregate_values (identifier (identifier_value) (description)) (comment) (identifier (identifier_value) (description)) (identifier (identifier_value) (description)))))